{"class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "QuantizedConv2D", "config": {"dtype": "float32", "trainable": true, "filters": 32, "use_bias": true, "bias_regularizer": null, "kernel_lr_multiplier": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 1, "seed": null, "minval": -1}}, "kernel_constraint": {"class_name": "Clip", "config": {"max_value": 1, "min_value": -1, "name": "__call__"}}, "H": 1, "activation": "linear", "padding": "same", "strides": [1, 1], "name": "quantized_conv2d_49", "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_lr_multiplier": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_54", "epsilon": 0.0001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.1, "center": true}}, {"class_name": "Activation", "config": {"activation": "quantized_relu", "trainable": true, "name": "activation_54"}}, {"class_name": "QuantizedConv2D", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 1, "seed": null, "minval": -1}}, "name": "quantized_conv2d_50", "kernel_constraint": {"class_name": "Clip", "config": {"max_value": 1, "min_value": -1, "name": "__call__"}}, "bias_regularizer": null, "bias_constraint": null, "H": 1, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_lr_multiplier": null, "kernel_lr_multiplier": 10, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_55", "epsilon": 0.0001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.1, "center": true}}, {"class_name": "Activation", "config": {"activation": "quantized_relu", "trainable": true, "name": "activation_55"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_24", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "QuantizedConv2D", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 1, "seed": null, "minval": -1}}, "name": "quantized_conv2d_51", "kernel_constraint": {"class_name": "Clip", "config": {"max_value": 1, "min_value": -1, "name": "__call__"}}, "bias_regularizer": null, "bias_constraint": null, "H": 1, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_lr_multiplier": null, "kernel_lr_multiplier": 10, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_56", "epsilon": 0.0001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.1, "center": true}}, {"class_name": "Activation", "config": {"activation": "quantized_relu", "trainable": true, "name": "activation_56"}}, {"class_name": "QuantizedConv2D", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 1, "seed": null, "minval": -1}}, "name": "quantized_conv2d_52", "kernel_constraint": {"class_name": "Clip", "config": {"max_value": 1, "min_value": -1, "name": "__call__"}}, "bias_regularizer": null, "bias_constraint": null, "H": 1, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_lr_multiplier": null, "kernel_lr_multiplier": 10, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_57", "epsilon": 0.0001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.1, "center": true}}, {"class_name": "Activation", "config": {"activation": "quantized_relu", "trainable": true, "name": "activation_57"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_25", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "QuantizedConv2D", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 1, "seed": null, "minval": -1}}, "name": "quantized_conv2d_53", "kernel_constraint": {"class_name": "Clip", "config": {"max_value": 1, "min_value": -1, "name": "__call__"}}, "bias_regularizer": null, "bias_constraint": null, "H": 1, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_lr_multiplier": null, "kernel_lr_multiplier": 10, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_58", "epsilon": 0.0001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.1, "center": true}}, {"class_name": "Activation", "config": {"activation": "quantized_relu", "trainable": true, "name": "activation_58"}}, {"class_name": "QuantizedConv2D", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 1, "seed": null, "minval": -1}}, "name": "quantized_conv2d_54", "kernel_constraint": {"class_name": "Clip", "config": {"max_value": 1, "min_value": -1, "name": "__call__"}}, "bias_regularizer": null, "bias_constraint": null, "H": 1, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_lr_multiplier": null, "kernel_lr_multiplier": 10, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_59", "epsilon": 0.0001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.1, "center": true}}, {"class_name": "Activation", "config": {"activation": "quantized_relu", "trainable": true, "name": "activation_59"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_26", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_8", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": false, "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_60", "epsilon": 0.0001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.1, "center": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_60"}}], "backend": "tensorflow"}